In [6]:
import pandas as pd
import numpy as np

In [7]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [8]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
string_data[0] = None

In [11]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [12]:
from numpy import nan as NA

In [13]:
data = pd.Series([1,NA,3.5,NA,7])

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [17]:
cleaned = data.dropna()

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis = 1,how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df.iloc[:4,1] = NA

In [28]:
df.iloc[:2,2] = NA

In [29]:
df

          0         1         2
0 -1.135302       NaN       NaN
1 -1.063236       NaN       NaN
2 -0.980589       NaN  0.508982
3 -1.644769       NaN  1.261227
4 -0.077614 -1.169953 -1.547178
5  0.004720 -0.510666 -1.126665
6  0.256270  0.365268  0.362987

In [30]:
df.dropna()

          0         1         2
4 -0.077614 -1.169953 -1.547178
5  0.004720 -0.510666 -1.126665
6  0.256270  0.365268  0.362987

In [31]:
df.dropna(thresh = 2)

          0         1         2
2 -0.980589       NaN  0.508982
3 -1.644769       NaN  1.261227
4 -0.077614 -1.169953 -1.547178
5  0.004720 -0.510666 -1.126665
6  0.256270  0.365268  0.362987

In [32]:
df.fillna(0)

          0         1         2
0 -1.135302  0.000000  0.000000
1 -1.063236  0.000000  0.000000
2 -0.980589  0.000000  0.508982
3 -1.644769  0.000000  1.261227
4 -0.077614 -1.169953 -1.547178
5  0.004720 -0.510666 -1.126665
6  0.256270  0.365268  0.362987

In [35]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.135302  0.500000  0.000000
1 -1.063236  0.500000  0.000000
2 -0.980589  0.500000  0.508982
3 -1.644769  0.500000  1.261227
4 -0.077614 -1.169953 -1.547178
5  0.004720 -0.510666 -1.126665
6  0.256270  0.365268  0.362987

In [36]:
_ =df.fillna(0,inplace = True)

In [37]:
df

          0         1         2
0 -1.135302  0.000000  0.000000
1 -1.063236  0.000000  0.000000
2 -0.980589  0.000000  0.508982
3 -1.644769  0.000000  1.261227
4 -0.077614 -1.169953 -1.547178
5  0.004720 -0.510666 -1.126665
6  0.256270  0.365268  0.362987

In [38]:
df = pd.DataFrame(np.random.randn(6,3))

In [39]:
df.iloc[2:,1] = NA

In [40]:
df.iloc[4:,2] = NA

In [41]:
df

          0         1         2
0  1.800303  0.787501  0.050002
1 -1.543288  1.872640  0.123390
2 -0.061691       NaN -1.015187
3 -0.735703       NaN  0.066206
4 -0.885035       NaN       NaN
5  1.717479       NaN       NaN

In [42]:
df.fillna(method = 'ffill')

          0         1         2
0  1.800303  0.787501  0.050002
1 -1.543288  1.872640  0.123390
2 -0.061691  1.872640 -1.015187
3 -0.735703  1.872640  0.066206
4 -0.885035  1.872640  0.066206
5  1.717479  1.872640  0.066206

In [43]:
df.fillna(method = 'ffill',limit = 2)

          0         1         2
0  1.800303  0.787501  0.050002
1 -1.543288  1.872640  0.123390
2 -0.061691  1.872640 -1.015187
3 -0.735703  1.872640  0.066206
4 -0.885035       NaN  0.066206
5  1.717479       NaN  0.066206

In [44]:
data = pd.Series([1.,NA,3.5,NA,7])

In [45]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [47]:
data = pd.DataFrame({'k1':['one','two']*3 +['two'],'k2':[1,1,2,3,3,4,4]})

In [48]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(7)

In [52]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [55]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [59]:
meat_to_animal = {'bacon':'pig',
                 'pulled pork':'pig',
                 'pastrami':'cow',
                 'corned beef':'cow',
                 'honey ham':'pig',
                 'nova lox':'salmon'}

In [60]:
lowercased = data['food'].str.lower()

In [61]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [62]:
data['animal'] = lowercased.map(meat_to_animal)

In [63]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [64]:
data['food'].map(lambda x :meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [65]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [66]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [69]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [70]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])

In [71]:
transform = lambda x :x[:4].upper()

In [72]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [73]:
data.index = data.index.map(transform)

In [74]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [76]:
data.rename(index = str.title,columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [79]:
data.rename(index = {'OHIO':'INDIANA'},
           columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [81]:
data.rename(index = {'OHIO':'INDIANA'},inplace = True)

In [82]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [83]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [84]:
bins = [18,25,35,60,100]

In [85]:
cats = pd.cut(ages,bins)

In [87]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [88]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [89]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [90]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [91]:
pd.cut(ages,[18,26,36,61,100],right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [92]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [93]:
pd.cut(ages,bins,labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [94]:
data = np.random.randn(20)

In [95]:
pd.cut(data,4,precision = 2)

[(-1.1, -0.084], (-0.084, 0.93], (-2.11, -1.1], (-2.11, -1.1], (-1.1, -0.084], ..., (-1.1, -0.084], (-1.1, -0.084], (-2.11, -1.1], (-1.1, -0.084], (-2.11, -1.1]]
Length: 20
Categories (4, interval[float64]): [(-2.11, -1.1] < (-1.1, -0.084] < (-0.084, 0.93] < (0.93, 1.94]]

In [96]:
data = np.random.randn(1000)

In [97]:
cats = pd.qcut(data,4)

In [98]:
cats

[(-0.633, 0.0469], (-0.633, 0.0469], (-3.108, -0.633], (-3.108, -0.633], (0.712, 3.13], ..., (-3.108, -0.633], (0.712, 3.13], (0.712, 3.13], (-3.108, -0.633], (-0.633, 0.0469]]
Length: 1000
Categories (4, interval[float64]): [(-3.108, -0.633] < (-0.633, 0.0469] < (0.0469, 0.712] < (0.712, 3.13]]

In [101]:
pd.value_counts(cats)

(0.712, 3.13]       250
(0.0469, 0.712]     250
(-0.633, 0.0469]    250
(-3.108, -0.633]    250
dtype: int64

In [102]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.207, 0.0469], (-1.207, 0.0469], (-1.207, 0.0469], (-1.207, 0.0469], (1.324, 3.13], ..., (-3.108, -1.207], (0.0469, 1.324], (0.0469, 1.324], (-3.108, -1.207], (-1.207, 0.0469]]
Length: 1000
Categories (4, interval[float64]): [(-3.108, -1.207] < (-1.207, 0.0469] < (0.0469, 1.324] < (1.324, 3.13]]

In [108]:
data = pd.DataFrame(np.random.randn(1000,4))

In [109]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017807    -0.029328    -0.067446    -0.076699
std       1.010274     1.014142     0.969655     1.021613
min      -3.154486    -2.900366    -3.199000    -3.364043
25%      -0.668078    -0.762183    -0.705421    -0.722179
50%       0.012661     0.009370    -0.074188    -0.079459
75%       0.736444     0.721275     0.585859     0.631721
max       3.207326     2.825193     3.019707     3.310559

In [110]:
col = data[2]

In [111]:
col[np.abs(col) > 3]

946    3.019707
967   -3.199000
Name: 2, dtype: float64

In [112]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
105 -0.148221 -0.976799  0.386349 -3.308078
493 -0.860628  1.166425  0.095983 -3.364043
500 -0.356841 -0.506957 -1.384567  3.310559
645  0.355921  0.080689 -1.327719 -3.340226
758  3.207326 -0.286504  0.354803  0.296613
788 -3.072312  0.590388  0.019720 -0.767983
946 -0.164476 -1.446686  3.019707 -0.595285
967  1.461193 -0.509913 -3.199000 -0.531881
988 -3.154486  0.099320 -0.738386  0.735613

In [113]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [114]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017826    -0.029328    -0.067267    -0.075997
std       1.008946     1.014142     0.968969     1.017553
min      -3.000000    -2.900366    -3.000000    -3.000000
25%      -0.668078    -0.762183    -0.705421    -0.722179
50%       0.012661     0.009370    -0.074188    -0.079459
75%       0.736444     0.721275     0.585859     0.631721
max       3.000000     2.825193     3.000000     3.000000

In [115]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0

In [116]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))

In [117]:
sampler = np.random.permutation(5)

In [118]:
sampler

array([1, 3, 4, 0, 2])

In [119]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [120]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [121]:
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
0  0  1   2   3
2  8  9  10  11

In [122]:
choices = pd.Series([5,7,-1,6,4])

In [125]:
draws = choices.sample(n=10,replace = True)

In [126]:
draws

1    7
1    7
0    5
1    7
0    5
2   -1
0    5
2   -1
4    4
2   -1
dtype: int64

In [127]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],
                  'data1':range(6)})

In [128]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [129]:
dummies = pd.get_dummies(df['key'],prefix = 'key')

In [130]:
df_with_dummy = df[['data1']].join(dummies)

In [131]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [132]:
mnames = ['movie_id','title','genres']

In [133]:
movies = pd.read_table('datasets/movielens/movies.dat',sep='::',header = None,names = mnames)

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [134]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [135]:
all_genres = []

In [137]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [138]:
genres = pd.unique(all_genres)

In [139]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [140]:
zero_matrix = np.zeros((len(movies),len(genres)))

In [141]:
dummies = pd.DataFrame(zero_matrix,columns=genres)

In [142]:
gen = movies.genres[0]

In [143]:
gen.split("|")

['Animation', "Children's", 'Comedy']

In [144]:
dummies.columns.get_indexer(gen.split("|"))

array([0, 1, 2], dtype=int64)

In [145]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split("|"))
    dummies.iloc[i,indices] = 1

In [146]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [147]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [148]:
np.random.seed(12345)

In [149]:
values = np.random.rand(10)

In [150]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [151]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [152]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [153]:
val = 'a,b,guido'

In [154]:
val.split(',')

['a', 'b', 'guido']

In [155]:
pieces = [x.strip() for x in val.split(",")]

In [156]:
pieces

['a', 'b', 'guido']

In [157]:
first,second,third = pieces

In [158]:
first + '::' + second + '::' + third

'a::b::guido'

In [159]:
'::'.join(pieces)

'a::b::guido'

In [160]:
'guido' in val

True

In [161]:
val.index(',')

1

In [162]:
val.find(':')

-1

In [164]:
val.index(":")

ValueError: substring not found

In [165]:
val.count(",")

2

In [166]:
val.replace(',','::')

'a::b::guido'

In [167]:
val.replace(',','')

'abguido'

In [209]:
import re

In [210]:
text = "foo   bar\t  baz   \tqux"

In [211]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [212]:
regex = re.compile('\s+')

In [213]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [214]:
regex.findall(text)

['   ', '\t  ', '   \t']

In [215]:
text ="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [218]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [219]:
regex = re.compile(pattern,flags = re.IGNORECASE)

In [220]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [221]:
m = regex.search(text)

In [222]:
m

In [223]:
text[m.start():m.end()]

'dave@google.com'

In [224]:
print(regex.match(text))

None

In [225]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [232]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [233]:
regex = re.compile(pattern,flags = re.IGNORECASE)

In [234]:
m = regex.match('wesm@bright.net')

In [235]:
m.group()

'wesm@bright.net'

In [236]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [239]:
print(regex.sub(r'Username:  \1,Domain:  \2,Suffix:  \3',text))

Dave Username:  dave,Domain:  google,Suffix:  com
Steve Username:  steve,Domain:  gmail,Suffix:  com
Rob Username:  rob,Domain:  gmail,Suffix:  com
Ryan Username:  ryan,Domain:  yahoo,Suffix:  com

In [240]:
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [241]:
data = pd.Series(data)

In [242]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [243]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [244]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [245]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [246]:
data.str.findall(pattern,flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [247]:
matches = data.str.match(pattern,flags = re.IGNORECASE)

In [248]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [249]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [250]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [251]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [252]:
data = pd.Series(np.random.randn(9),
                index = [['a','a','a','b','b','c','c','d','d'],
                        [1,2,3,1,3,1,2,2,3]])

In [253]:
data

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [255]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [256]:
data['b']

1    0.228913
3    1.352917
dtype: float64

In [259]:
data['b':"c"]

b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
dtype: float64

In [260]:
data.loc[['b','d']]

b  1    0.228913
   3    1.352917
d  2   -0.371843
   3    1.669025
dtype: float64

In [261]:
data.loc[:,2]

a   -1.296221
c   -2.001637
d   -0.371843
dtype: float64

In [262]:
data.unstack()

          1         2         3
a  1.007189 -1.296221  0.274992
b  0.228913       NaN  1.352917
c  0.886429 -2.001637       NaN
d       NaN -0.371843  1.669025

In [263]:
data.unstack().stack()

a  1    1.007189
   2   -1.296221
   3    0.274992
b  1    0.228913
   3    1.352917
c  1    0.886429
   2   -2.001637
d  2   -0.371843
   3    1.669025
dtype: float64

In [264]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index = [['a','a','b','b'],[1,2,1,2]],
                     columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [265]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [266]:
frame.index.names = ['key1','key2']

In [267]:
frame.columns.names = ['state','color']

In [268]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [269]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [272]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [273]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [274]:
frame.swaplevel(0,1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [275]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [276]:
frame.sum(level = 'color',axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [277]:
frame = pd.DataFrame({'a':range(7),'b':range(7,0,-1),
                     'c':['one','one','one','two','two','two','two'],
                     'd':[0,1,2,0,1,2,3]})

In [278]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [279]:
frame2 = frame.set_index(['c','d'])

In [280]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [281]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [282]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [283]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                   'data1':range(7)})

In [284]:
df2 = pd.DataFrame({'key':['a','b','c'],
                   'data2':range(3)})

In [285]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [286]:
df2

  key  data2
0   a      0
1   b      1
2   c      2

In [287]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3      2

In [288]:
pd.merge(df1,df2,on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3      2

In [290]:
df3 = pd.DataFrame({'1key':['b','b','a','c','a','a','b'],
                   'data1':range(7)})

In [292]:
df4 = pd.DataFrame({'rkey':['a','b','c'],
                   'data2':range(3)})

In [294]:
pd.merge(df3,df4,left_on = '1key', right_on = 'rkey')

  1key  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0
6    c      3    c      2

In [295]:
pd.merge(df1,df2,how = 'outer')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3      2

In [296]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'],
                   'data1':range(6)})

In [297]:
df2 = pd.DataFrame({'key':['a','b','a','b','d'],
                   'data2':range(5)})

In [298]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [299]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [300]:
pd.merge(df1,df2,on = 'key',how = 'left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [301]:
pd.merge(df1,df2,how = 'inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [302]:
left = pd.DataFrame({'key1':['foo','foo','bar'],
                    'key2':['one','two','one'],
                    'lval':[1,2,3]})

In [303]:
right = pd.DataFrame({'key1':['foo','foo','bar','bar'],
                     'key2':['one','one','one','two'],
                     'rval':[4,5,6,7]})

In [304]:
pd.merge(left,right,on = ['key1','key2'],how = 'outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [305]:
pd.merge(left,right,on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [306]:
pd.merge(left,right,on = 'key1',suffixes = ('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [307]:
#

In [308]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],
                     'value':range(6)})

In [309]:
right1 =pd.DataFrame({'group_val':[3.5,7]},index = {'a','b'})

In [310]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [311]:
right1

   group_val
a        3.5
b        7.0

In [312]:
pd.merge(left1,right1,left_on = 'key',right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [313]:
lefth = pd.DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                     'key2':[2002,2001,2002,2001,2002],'data':np.arange(5.)})

In [314]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                     index = [['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                             [2001,2000,2000,2000,2001,2002]],columns = ['event1','event2'])

In [315]:
lefth

     key1  key2  data
0    Ohio  2002   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [316]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [317]:
pd.merge(lefth,righth,left_on = ['key1','key2'],right_index = True)

     key1  key2  data  event1  event2
0    Ohio  2002   0.0      10      11
2    Ohio  2002   2.0      10      11
1    Ohio  2001   1.0       8       9
3  Nevada  2001   3.0       0       1

In [318]:
pd.merge(lefth,righth,left_on = ['key1','key2'],
         right_index = True,how  = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2002   0.0    10.0    11.0
2    Ohio  2002   2.0    10.0    11.0
1    Ohio  2001   1.0     8.0     9.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0
4    Ohio  2000   NaN     4.0     5.0
4    Ohio  2000   NaN     6.0     7.0

In [319]:
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],
                    index = ['a','b','c'],
                    columns = ['Ohio','Nevada'])

In [320]:
right2 = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14]],
                     index = ['b','c','d','e'],
                     columns = ['Missouri','Alabama'])

In [321]:
left2

   Ohio  Nevada
a   1.0     2.0
b   3.0     4.0
c   5.0     6.0

In [322]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [323]:
pd.merge(left2,right2,how = 'outer',left_index = True,
        right_index =True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   5.0     6.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   NaN     NaN      13.0     14.0

In [324]:
left2.join(right2,how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   3.0     4.0       7.0      8.0
c   5.0     6.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   NaN     NaN      13.0     14.0

In [325]:
left1.join(right1,on = 'key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [326]:
another = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                      index = ['a','c','e','f'],
                      columns = ['New York','Oregon'])

In [329]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [330]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   3.0     4.0       7.0      8.0       NaN     NaN
c   5.0     6.0       9.0     10.0       9.0    10.0

In [331]:
left2.join([right2,another],how = 'outer')

C:\Users\admin\AppData\Roaming\Python\Python36\site-packages\pandas\core\frame.py:6369: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   3.0     4.0       7.0      8.0       NaN     NaN
c   5.0     6.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   NaN     NaN      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [333]:
arr = np.arange(12).reshape((3,4))

In [334]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [335]:
np.concatenate([arr,arr],axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [336]:
s1 = pd.Series([0,1],index = ['a','b'])

In [337]:
s2 = pd.Series([2,3,4],index = ['c','d','e'])

In [338]:
s3 = pd.Series([5,6],index = ['f','g'])

In [339]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [341]:
pd.concat([s1,s2,s3],axis = 1)

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [342]:
s4 = pd.concat([s1,s3])

In [344]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [345]:
pd.concat([s1,s4],axis = 1)

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [346]:
pd.concat([s1,s4],axis = 1,join = 'inner')

   0  1
a  0  0
b  1  1

In [347]:
pd.concat([s1,s4],axis = 1,join_axes = [['a','c','b','e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [348]:
result = pd.concat([s1,s2,s3],keys = ['one','two','three'])

In [349]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [350]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [351]:
pd.concat([s1,s2,s3],axis = 1,keys = ['one','two','three'])

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [352]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),index = ['a','b','c'],columns = ['one','two'])

In [353]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2),
                  index =['a','c'],
                  columns = ['three','four'])

In [354]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [355]:
df2

   three  four
a      5     6
c      7     8

In [356]:
pd.concat([df1,df2],axis = 1,keys = ['level1','level2'])

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [357]:
pd.concat({'level1':df1,'level2':df2},axis = 1)

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [358]:
pd.concat([df1,df2],axis = 1, keys = ['level1','level2'],
         names = ['upper','lower'])

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [361]:
df1 = pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])

In [362]:
df2 = pd.DataFrame(np.random.randn(2,3),columns = ['b','d','a'])

In [363]:
df1

          a         b         c         d
0 -0.438570 -0.539741  0.476985  3.248944
1 -1.021228 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810 -0.713544

In [364]:
df2

          b         d         a
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934

In [365]:
pd.concat([df1,df2],ignore_index = True)

D:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0 -0.438570 -0.539741  0.476985  3.248944
1 -1.021228 -0.577087  0.124121  0.302614
2  0.523772  0.000940  1.343810 -0.713544
3 -1.860761 -0.831154       NaN -2.370232
4 -1.265934 -0.860757       NaN  0.560145

In [366]:
a = pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
             index = ['f','e','d','c','b','a'])

In [367]:
b = pd.Series(np.arange(len(a),dtype = np.float64),
             index = ['f','e','d','c','b','a'])

In [368]:
b[-1] = np.nan

In [369]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [370]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [371]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [372]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [377]:
df1 = pd.DataFrame({'a':[1.,np.nan,5.,np.nan],
                   'b':[np.nan,2.,np.nan,6.],
                   'c':range(2,18,4)})

In [380]:
df2 = pd.DataFrame({'a':[5.,4.,np.nan,3.,7.],
                   'b':[np.nan,3.,4.,6.,8.]})

In [381]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [382]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [383]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [396]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index = pd.Index(['Ohio','Colorado'],name = 'state'),
                   columns = pd.Index(['one','two','three'],
                                     name = 'number'))

In [397]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [398]:
result = data.stack()

In [399]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [400]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [401]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [402]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [403]:
s1 = pd.Series([0,1,2,3],index = ['a','b','c','d'])

In [404]:
s2 = pd.Series([4,5,6],index = ['c','d','e'])

In [406]:
data2 = pd.concat([s1,s2],keys = ['one','two'])

In [408]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [409]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [410]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [411]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [412]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [413]:
data2.unstack().stack(dropna = False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [414]:
df = pd.DataFrame({'left':result,'right':result+5},
                 columns = pd.Index(['left','right'],name = 'side'))

In [415]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [416]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [417]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [429]:
data = pd.read_csv('examples/macrodata.csv')

In [430]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [431]:
periods = pd.PeriodIndex(year = data.year,
                        quarter = data.quarter,name = 'date')

In [432]:
columns = pd.Index(['realgdp','infl','unemp'],name = 'item')

In [433]:
data = data.reindex(columns = columns)

In [434]:
data.index = periods.to_timestamp('D','end')

In [435]:
ldata = data.stack().reset_index().rename(columns = {0:'value'})

In [436]:
pivoted = ldata.pivot('date','item','value')

In [437]:
pivoted

item        infl    realgdp  unemp
date
1959-03-31  0.00   2710.349    5.8
1959-06-30  2.34   2778.801    5.1
1959-09-30  2.74   2775.488    5.3
1959-12-31  0.27   2785.204    5.6
1960-03-31  2.31   2847.699    5.2
1960-06-30  0.14   2834.390    5.2
1960-09-30  2.70   2839.022    5.6
1960-12-31  1.21   2802.616    6.3
1961-03-31 -0.40   2819.264    6.8
1961-06-30  1.47   2872.005    7.0
1961-09-30  0.80   2918.419    6.8
1961-12-31  0.80   2977.830    6.2
1962-03-31  2.26   3031.241    5.6
1962-06-30  0.13   3064.709    5.5
1962-09-30  2.11   3093.047    5.6
1962-12-31  0.79   3100.563    5.5
1963-03-31  0.53   3141.087    5.8
1963-06-30  2.75   3180.447    5.7
1963-09-30  0.78   3240.332    5.5
1963-12-31  2.46   3264.967    5.6
1964-03-31  0.13   3338.246    5.5
1964-06-30  0.90   3376.587    5.2
1964-09-30  1.29   3422.469    5.0
1964-12-31  2.05   3431.957    5.0
1965-03-31  1.28   3516.251    4.9
1965-06-30  2.54   3563.960    4.7
1965-09-30  0.89   3636.285    4.4
1965-12-31  2.90   3724.014    4.1
1966-03-31  4.99   3815.423    3.9
1966-06-30  2.10   3828.124    3.8
...          ...        ...    ...
2002-06-30  1.56  11538.770    5.8
2002-09-30  2.66  11596.430    5.7
2002-12-31  3.08  11598.824    5.8
2003-03-31  1.31  11645.819    5.9
2003-06-30  1.09  11738.706    6.2
2003-09-30  2.60  11935.461    6.1
2003-12-31  3.02  12042.817    5.8
2004-03-31  2.35  12127.623    5.7
2004-06-30  3.61  12213.818    5.6
2004-09-30  3.58  12303.533    5.4
2004-12-31  2.09  12410.282    5.4
2005-03-31  4.15  12534.113    5.3
2005-06-30  1.85  12587.535    5.1
2005-09-30  9.14  12683.153    5.0
2005-12-31  0.40  12748.699    4.9
2006-03-31  2.60  12915.938    4.7
2006-06-30  3.97  12962.462    4.7
2006-09-30 -1.58  12965.916    4.7
2006-12-31  3.30  13060.679    4.4
2007-03-31  4.58  13099.901    4.5
2007-06-30  2.75  13203.977    4.5
2007-09-30  3.45  13321.109    4.7
2007-12-31  6.38  13391.249    4.8
2008-03-31  2.82  13366.865    4.9
2008-06-30  8.53  13415.266    5.4
2008-09-30 -3.16  13324.600    6.0
2008-12-31 -8.79  13141.920    6.9
2009-03-31  0.94  12925.410    8.1
2009-06-30  3.37  12901.504    9.2
2009-09-30  3.56  12990.341    9.6

[203 rows x 3 columns]

In [438]:
ldata['value2'] = np.random.randn(len(ldata))

In [439]:
ldata[:10]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349  0.119827
1 1959-03-31     infl     0.000 -1.063512
2 1959-03-31    unemp     5.800  0.332883
3 1959-06-30  realgdp  2778.801 -2.359419
4 1959-06-30     infl     2.340 -0.199543
5 1959-06-30    unemp     5.100 -1.541996
6 1959-09-30  realgdp  2775.488 -0.970736
7 1959-09-30     infl     2.740 -1.307030
8 1959-09-30    unemp     5.300  0.286350
9 1959-12-31  realgdp  2785.204  0.377984

In [440]:
pivoted = ldata.pivot('date','item')

In [442]:
pivoted[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -1.063512  0.119827  0.332883
1959-06-30  2.34  2778.801   5.1 -0.199543 -2.359419 -1.541996
1959-09-30  2.74  2775.488   5.3 -1.307030 -0.970736  0.286350
1959-12-31  0.27  2785.204   5.6 -0.753887  0.377984  0.331286
1960-03-31  2.31  2847.699   5.2  0.069877  1.349742  0.246674

In [443]:
pivoted['value'][:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [444]:
unstacked = ldata.set_index(['date','item']).unstack('item')

In [445]:
unstacked[:7]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -1.063512  0.119827  0.332883
1959-06-30  2.34  2778.801   5.1 -0.199543 -2.359419 -1.541996
1959-09-30  2.74  2775.488   5.3 -1.307030 -0.970736  0.286350
1959-12-31  0.27  2785.204   5.6 -0.753887  0.377984  0.331286
1960-03-31  2.31  2847.699   5.2  0.069877  1.349742  0.246674
1960-06-30  0.14  2834.390   5.2  1.004812 -0.011862  1.327195
1960-09-30  2.70  2839.022   5.6 -1.549106 -0.919262  0.022185

In [446]:
df = pd.DataFrame({'key':['foo','bar','baz'],
                  'A':[1,2,3],
                  'B':[4,5,6],
                  'C':[7,8,9]})

In [447]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [452]:
melted = pd.melt(df,['key'])

In [453]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [454]:
reshape = melted.pivot('key','variable','value')

In [455]:
reshape

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [456]:
pd.melt(df,id_vars=['key'],value_vars = ['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [457]:
pd.melt(df,value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [458]:
pd.melt(df,value_vars=['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6